#todo: Определить в коде  переменные:

#1. Целочисленного типа
#2. Вещественного типа
#3. Логического типа
#4. Строкового типа
#5. Пустого типа

#Вывести все их типы.

a = int(10)
b = float(10)
c = bool(True)
d = str("Десять")
e = ()

print (type(a))
print (type(b))
print (type(c))
print (type(d))
print (type(e))