
#todo: Написать программу, которая считывает два числа и выводит их сумму, разность, частное, произведение,
# результат целочисленного деления, результат деления с остатком, результат возведения в степень.

x = float(input("Введите первое число "))
y = float(input("Введите второе число "))
a = x + y
b = x - y
c = x / y
d = x * y
e = x // y
f = x % y
g = x ** y
print ("Сумма равна ", a)
print ("Разность чисел равна ",b)
print ("Частное ",c)
print ("Произведение ",d)
print ("Результат целочисленного деления ",e)
print ("Результат деления с остатком ",f)
print ("Результат возведения в степень ",g)