#todo:Создайте программу, которая будет выводить все возможные комбинации при броске 2 игральных костей
#и сумму их значений. У игральной кости стороны пронумерованы от 1 до 6.

#Пример вывода:
#Сумма 2   комбинация [(1,1)]
#Сумма 3   комбинация [(1,2),(2,1)]
#Сумма 4   комбинация [(1,3),(3,1),(2,2)]
#........................................
#Выводы комбинаций оформить в список кортежей.

empty_tuple = ()
a = 1
b = 0
x = ()
y = ()
z = ()
m = ()
i = 0
k = 0
l = 0

while a < 7:
    while b < 6:
        x = (a, b+1)
        empty_tuple += x,
        b = b + 1
    a = a + 1
    b = 0

print(empty_tuple)
for a in empty_tuple:
    y = int(a[0]) + int(a[1])
    z += y,

print(z)

for k in range(len(z)):
    if z[:k].count(z[k]) < 1:
        abc = [i for i, ltr in enumerate(z) if ltr == z[k]]
        for l in range(len(abc)):
            m += empty_tuple[abc[l]],

            l += 1
        print("Сумма ", z[k], " для комбинаций ", m)
        k += 1
        m = ()
    else:
        k += 1
